INTRODUCTION TO PANDAS

In [5]:
import pandas as pd
import numpy as nu

In [6]:
 s = pd.Series([10, 20, 30, 40])
print(s)
 data = {
    "a": 10,
    "b": 20,
    "c": 30
}

s = pd.Series(data)

print(s)
data = {
    "Name": ["Aman", "krish", "karan"],
    "Age": [22, 23, 21],
    "Marks": [85, 90, 88]
}
 print(data)
 type(data)
 marks = pd.DataFrame(data)
 print(marks)

0    10
1    20
2    30
3    40
dtype: int64
a    10
b    20
c    30
dtype: int64
{'Name': ['Aman', 'krish', 'karan'], 'Age': [22, 23, 21], 'Marks': [85, 90, 88]}
    Name  Age  Marks
0   Aman   22     85
1  krish   23     90
2  karan   21     88

In [8]:
#we can also add custom index in python
marks=pd.DataFrame(data,
                   index=["student1","student2","student3"])

In [9]:
print(marks)

           Name  Age  Marks
student1   Aman   22     85
student2  krish   23     90
student3  karan   21     88

In [14]:
marks.set_index("Name", inplace=True)
print(marks)

       Age  Marks
Name
Aman    22     85
krish   23     90
karan   21     88

In [18]:
df=pd.DataFrame({
    "Name":["abx","xos","afs"],
    "Age":[12,21,33],
    "Marks":[88,99,98]
})
print(df)

  Name  Age  Marks
0  abx   12     88
1  xos   21     99
2  afs   33     98

In [ ]:
df.head()

  Name  Age  Marks
0  abx   12     88
1  xos   21     99
2  afs   33     98

In [21]:
df.tail()

  Name  Age  Marks
0  abx   12     88
1  xos   21     99
2  afs   33     98

In [23]:
df[df["Marks"]>85]

  Name  Age  Marks
0  abx   12     88
1  xos   21     99
2  afs   33     98

In [26]:
df["Name"]

0    abx
1    xos
2    afs
Name: Name, dtype: object

In [28]:
df[(df["Age"]>21) & (df["Marks"]>85)]

  Name  Age  Marks
2  afs   33     98

In [30]:
df.sort_values("Marks")

  Name  Age  Marks
0  abx   12     88
2  afs   33     98
1  xos   21     99

In [31]:
df.sort_values("Marks",ascending=False)

  Name  Age  Marks
1  xos   21     99
2  afs   33     98
0  abx   12     88

In [32]:
df["Age"].value_counts()

Age
12    1
21    1
33    1
Name: count, dtype: int64

In [1]:
import pandas as pd

Handling missing values

In [3]:
#updating the dataset with null values

df=pd.DataFrame({
    "Name":["Aman","Saurav","Karan","subham",None,"Sameer"],
    "Age":[22,23,None,22,25,26],
    "Marks":[85,None,88,90,66,None]
})

df

     Name   Age  Marks
0    Aman  22.0   85.0
1  Saurav  23.0    NaN
2   Karan   NaN   88.0
3  subham  22.0   90.0
4    None  25.0   66.0
5  Sameer  26.0    NaN

In [4]:
df.isnull()

    Name    Age  Marks
0  False  False  False
1  False  False   True
2  False   True  False
3  False  False  False
4   True  False  False
5  False  False   True

In [5]:
df.isnull().sum()

Name     1
Age      1
Marks    2
dtype: int64

In [6]:
df.dropna()

     Name   Age  Marks
0    Aman  22.0   85.0
3  subham  22.0   90.0

In [7]:
print(df)

     Name   Age  Marks
0    Aman  22.0   85.0
1  Saurav  23.0    NaN
2   Karan   NaN   88.0
3  subham  22.0   90.0
4    None  25.0   66.0
5  Sameer  26.0    NaN

In [9]:
cleaned_data=df.dropna()
cleaned_data

     Name   Age  Marks
0    Aman  22.0   85.0
3  subham  22.0   90.0